app/controllers/entries_controller.rb

INSERT INTO "entries" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["description", "hello"], ["created_at", "2021-12-09 03:00:49.102260"], ["updated_at", "2021-12-09 03:00:49.102260"], ["user_id", 13]]
---
  def create
    #@entry = Entry.new(entry_params)

    #Updating create method to reflect the user-entry auth change...
    @entry = current_user.entries.build(entry_params)

    respond_to do |format|
      if @entry.save

UPDATE "entries" SET "updated_at" = ?, "is_anon" = ?, "is_private" = ? WHERE "entries"."id" = ?  [["updated_at", "2021-12-09 03:01:03.187602"], ["is_anon", 0], ["is_private", 0], ["id", 22]]
---
  def update
    respond_to do |format|
      if @entry.update(entry_params)

SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ? AND "entries"."id" = ? LIMIT ?  [["user_id", 14], ["id", 21], ["LIMIT", 1]]
---
  def correct_user
    @entry = current_user.entries.find_by(id: params[:id])