app/controllers/home_controller.rb

  def explore
    @entries = Entry.all
    @public_entries = Entry.where(is_private: false)
---
SELECT "entries".* FROM "entries"
SELECT "entries".* FROM "entries" WHERE "entries"."is_private" = ? AND (user is not (NULL))  [["is_private", 1]]