app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "Jake"], ["last_name", "Lehner"], ["email", "jlehner@tulane.edu"], ["age", "2021-10-19"], ["created_at", "2021-10-19 15:22:58.034580"], ["updated_at", "2021-10-19 15:22:58.034580"]]