app/models/user.rb

  def self.id_to_name id
    user = User.where(id: id)
    if user.length() == 0
---
SELECT "users".* FROM "users" WHERE "users"."id" = ?  [["id", 11]]